module.exports = {
    lang: {
        UA: 'UA',
        RU: 'RU',
    },
    homeRU: {
        price: 'Стоимость☺️',
        weddingSite: 'Свадебный сайт💍',
        detail: '✨Детали съемки',
    },
    homeUA: {
        price: 'Вартість☺️',
        weddingSite: 'Весільний сайт💍',
        detail: '✨Деталі зйомки',
    },
    home2: {
        contract: '📝Есть ли у вас договор?',
        deadlines: '🏇Сроки',
        reservation: 'Нужна ли предоплата?',
        // pak: '📂Пакеты',
        twoCamera: '🎥Вы снимаете в 2 камеры?',
        material: 'Отдаете ли исходный материал?',
        equipment: 'Какое оборудование используете?',
        pay: 'Оплата💳',
    },
    home2UA: {
        contract: '📝Чи є у вас договір?',
        deadlines: '🏇Термін',
        reservation: 'Потрібен завдаток?',
        // pak: '📂Пакеты',
        twoCamera: '🎥Ви знімаєте в дви камери?',
        material: 'Віддаєте вихідний матеріал?',
        equipment: 'Яке облданання викоростовуєте?',
        pay: 'Оплата💳',
    },
    home3: {
        hours8: '8 часов',
        hours10: '10 часов',
        hours12: '12 часов',
        hours: '......',
    },
    home3UA: {
        hours8: '8 годин',
        hours10: '10 годин',
        hours12: '12 годин',
        hours: '......',
    },
    home4: {

    },
    home5: {
        var1: 'Беленький',
        var2: 'Розовенький',
        var3: 'Строгий',
    },
    home5UA: {
        var1: 'Біленький',
        var2: 'Розовенький',
        var3: 'Строгий',
    },
    back: '↩️Назад',
    backUA: '↩️Назад',
    contact: '📞Контакты',
    contactUA: '📞Контакти',
};