module.exports = {
    home: {
        price: 'Стоимость',
        weddingSite: 'Свадбный сайт',
        locations: '🗺Где проходит сьемка?'
    },
    home2: {

        contract: '📝Есть ли у вас договор?',
        deadlines: '🏇Сроки',
        reservation: 'Нужна ли предоплата?',
        pak: '📂Пакеты',
        pay: 'Оплата💳',
    },
    home3: {
        hours8: '8 часов',
        hours10: '10 часов',
        hours12: '12 часов',
        hours: '......'
    },
    home4: {
        twoCamera: '🎥Вы снимате в 2 камеры?',
        material: 'Отдаете ли исходный материал?',
        equipment: 'Какое оборудование используете?'
    },
    home5: {
        var1: 'Беленький',
        var2: 'Розовенький',
        var3: 'Строгий'
    },
    back: '↩️Назад',
    contact: 'Контакты'
};